In [15]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

### Series

In [2]:
zzz = pd.Series([4,7,-5,3])
zzz

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
zzz.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
zzz.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
zzz2 = pd.Series([1,2,3,4,5], index= ['a:', 'b:', 'c:', 'd:','e:'])
zzz2

a:    1
b:    2
c:    3
d:    4
e:    5
dtype: int64

In [9]:
zzz2.index

Index(['a:', 'b:', 'c:', 'd:', 'e:'], dtype='object')

In [11]:
zzz2.values

array([1, 2, 3, 4, 5], dtype=int64)

In [12]:
zzz3 = pd.Series([-1,0,1,2])
zzz3[zzz3 > 0]

2    1
3    2
dtype: int64

In [13]:
zzz * 10

0    40
1    70
2   -50
3    30
dtype: int64

In [16]:
np.exp(zzz2)

a:      2.718282
b:      7.389056
c:     20.085537
d:     54.598150
e:    148.413159
dtype: float64

In [18]:
2 in zzz2

False

In [24]:
zzz_reptiles = {'Crocodile': 10000, 'Snake': 12000, 'Lizard': 11000}
series_reptiles = pd.Series(zzz_reptiles)
series_reptiles

Crocodile    10000
Snake        12000
Lizard       11000
dtype: int64

In [28]:
reptiles = ['Lizard','Snake','crocodile']
rep_series = pd.Series(zzz_reptiles, index= reptiles)
rep_series

Lizard       11000.0
Snake        12000.0
crocodile        NaN
dtype: float64

In [29]:
pd.isnull(rep_series)

Lizard       False
Snake        False
crocodile     True
dtype: bool

In [30]:
pd.notnull(rep_series)

Lizard        True
Snake         True
crocodile    False
dtype: bool

In [33]:
rep_series.name = 'sqvamatas'
rep_series

Lizard       11000.0
Snake        12000.0
crocodile        NaN
Name: sqvamatas, dtype: float64

In [38]:
zzz.index=['z0','z1', 'z2', 'z3']
print(zzz)

z0    4
z1    7
z2   -5
z3    3
dtype: int64

In [45]:
data = {'name':['Crocodile', 'Snake', 'Axolote', 'Lizard','Ophiophagus Hannah', 'Cameleon'],
        'price':[100,110,240,300,250,200],
        'numbers_live':[20,30,10,20,30,15]}

In [46]:
frame = pd.DataFrame(data)
frame

                 name  price  numbers_live
0           Crocodile    100            20
1               Snake    110            30
2             Axolote    240            10
3              Lizard    300            20
4  Ophiophagus Hannah    250            30
5            Cameleon    200            15

In [48]:
frame.head()

                 name  price  numbers_live
0           Crocodile    100            20
1               Snake    110            30
2             Axolote    240            10
3              Lizard    300            20
4  Ophiophagus Hannah    250            30

In [49]:
frame.tail()

                 name  price  numbers_live
1               Snake    110            30
2             Axolote    240            10
3              Lizard    300            20
4  Ophiophagus Hannah    250            30
5            Cameleon    200            15

In [54]:
pd.DataFrame(data,columns=['name', 'numbers_live','price'])
frame

                 name  price  numbers_live
0           Crocodile    100            20
1               Snake    110            30
2             Axolote    240            10
3              Lizard    300            20
4  Ophiophagus Hannah    250            30
5            Cameleon    200            15

In [56]:
frame2 = pd.DataFrame(data, columns=['name', 'numbers_live','price'],
index=['one', 'two', 'three', 'four',
'five', 'six'])

frame2

                     name  numbers_live  price
one             Crocodile            20    100
two                 Snake            30    110
three             Axolote            10    240
four               Lizard            20    300
five   Ophiophagus Hannah            30    250
six              Cameleon            15    200

In [57]:
frame2.columns

Index(['name', 'numbers_live', 'price'], dtype='object')

In [62]:
frame2['debt']= 15,16,17,18,19,20
frame2

                     name  numbers_live  price  debt
one             Crocodile            20    100    15
two                 Snake            30    110    16
three             Axolote            10    240    17
four               Lizard            20    300    18
five   Ophiophagus Hannah            30    250    19
six              Cameleon            15    200    20

In [64]:
frame2['scale'] = np.arange(6)
frame2

                     name  numbers_live  price  debt  zzz  scale
one             Crocodile            20    100    15    0      0
two                 Snake            30    110    16    1      1
three             Axolote            10    240    17    2      2
four               Lizard            20    300    18    3      3
five   Ophiophagus Hannah            30    250    19    4      4
six              Cameleon            15    200    20    5      5

In [58]:
frame2['name']

one               Crocodile
two                   Snake
three               Axolote
four                 Lizard
five     Ophiophagus Hannah
six                Cameleon
Name: name, dtype: object

In [65]:
val = pd.Series([-3,-2,-1], index=['three','two','one'])
frame2['debt'] = val
frame2

                     name  numbers_live  price  debt  zzz  scale
one             Crocodile            20    100  -1.0    0      0
two                 Snake            30    110  -2.0    1      1
three             Axolote            10    240  -3.0    2      2
four               Lizard            20    300   NaN    3      3
five   Ophiophagus Hannah            30    250   NaN    4      4
six              Cameleon            15    200   NaN    5      5

In [66]:
del frame2['zzz']
frame2

                     name  numbers_live  price  debt  scale
one             Crocodile            20    100  -1.0      0
two                 Snake            30    110  -2.0      1
three             Axolote            10    240  -3.0      2
four               Lizard            20    300   NaN      3
five   Ophiophagus Hannah            30    250   NaN      4
six              Cameleon            15    200   NaN      5

In [68]:
frame3 = frame2 
frame3.T

                    one    two    three    four                five       six
name          Crocodile  Snake  Axolote  Lizard  Ophiophagus Hannah  Cameleon
numbers_live         20     30       10      20                  30        15
price               100    110      240     300                 250       200
debt               -1.0   -2.0     -3.0     NaN                 NaN       NaN
scale                 0      1        2       3                   4         5